[
    {"id":"954ab75e-a886-49cd-9c75-33013e4b048d","type":"Full Time","url":"https://jobs.github.com/positions/954ab75e-a886-49cd-9c75-33013e4b048d","created_at":"Tue Nov 24 19:04:39 UTC 2020","company":"7 Chord","company_url":"http://http","location":"New York","title":"Machine Learning Engineer - Trading","description":"\u003cp\u003eThis is an exceptional opportunity for a high caliber MSc graduate or an experienced Machine Learning Engineer to join a successful revenue-generating capital markets tech firm with a ground-breaking predictive pricing product. You will work with some of the brightest minds in data science to find innovative solutions for storing, accessing, combining and synthesizing real-time data.\u003c/p\u003e\n\u003cp\u003eAbout Us:\n7 Chord is an award-winning FinTech start-up in NYC. BondDroid, our proprietary AI system, empowers bond traders and investors with predictive pricing and trading signals.  The firm was founded by market veterans and renowned machine learning researchers. We are backed by strategic investors and an elite group of former Wall Street executives.\u003c/p\u003e\n\u003cp\u003eTechstars Class of 2017 (1% acceptance rate)\nMarkets Choice Award for “Excellence in AI” 2019\nOn the list of “Most Innovative FinTech startups of 2019” by Harrington Starr\n2020 and 2019 Benzinga Global Fintech Awards List (“Best in AI” category)\nFinTechSandbox Alumni and Data Provider\u003c/p\u003e\n\u003cp\u003eWhat You'll Do:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork with data scientists to design, develop, and implement scalable ML solutions.\u003c/li\u003e\n\u003cli\u003eEmphasis will be on deploying real-time ML solutions in a production environment using cutting edge technologies with a focus on achieving scalable, low latency, optimized solutions.\u003c/li\u003e\n\u003cli\u003eWork with data scientists to develop new techniques to deal with ML solutions built on streaming data and solve problems inherent in financial data, including low signal-to-noise ratios and non-stationarity.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2+ years of professional experience in an enterprise-level environment.\u003c/li\u003e\n\u003cli\u003eMSc in Computer Science preferred.\u003c/li\u003e\n\u003cli\u003eExperience handling large volumes of real-time / streaming data, preferably in a financial domain.\u003c/li\u003e\n\u003cli\u003ePython 3 and PostgreSQL experience required.\u003c/li\u003e\n\u003cli\u003eExperience with scikit-learn required, bonus points for other popular ML libraries.\u003c/li\u003e\n\u003cli\u003eJava and MongoDB experience preferred but not required.\u003c/li\u003e\n\u003cli\u003eFamiliarity with messaging technologies (RabbitMQ, Kafka or Kinesis) and distributed cloud computing.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eComp, Benefits, Perks:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary. Equity. Enormous growth potential.\u003c/li\u003e\n\u003cli\u003eSubsidized health insurance, transportation benefit and 401K.\u003c/li\u003e\n\u003cli\u003eContinuing education stipend.\u003c/li\u003e\n\u003cli\u003eWork from home in 2020 and 2021. Once and if we go back to the office, free state-of-the-art gym and wellness center on premises. Access to the open private waterfront space, half-court basketball court, outdoor terraces, training and conference facilities, cafeteria and lounge.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePlease send your resume, including your linkedin and/or github profiles to: \u003ca href=\"mailto:careers@7-chord.com\"\u003ecareers@7-chord.com\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease send your resume, including your linkedin and/or github profiles to: \u003ca href=\"mailto:careers@7-chord.com\"\u003ecareers@7-chord.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2lSIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5c099f86472dd17b69407087f86e65fc32569b00/Copy%20of%20logo-7chord_symbol_trans-02.png"},

    {"id":"6b9dce23-5790-46eb-9fbe-8090704eecef","type":"Full Time","url":"https://jobs.github.com/positions/6b9dce23-5790-46eb-9fbe-8090704eecef","created_at":"Fri Nov 13 02:28:36 UTC 2020","company":"Marble","company_url":"http://marblepay.com","location":"New York","title":"Director, Engineering","description":"\u003cp\u003eCompany overview:\u003c/p\u003e\n\u003cp\u003eInsurance companies spend billions on marketing to find new customers, and often those costs come back to consumers in the form of higher premiums. We’re changing that.\n‍\nAt Marble, we put our members at the center of the insurance process so they can effortlessly protect the things they care about, all while earning the value they deserve. We’re laser-focused on saving insurance customers money by building a rewards-based membership program.\u003c/p\u003e\n\u003cp\u003eFor insurance companies, Marble is the most innovative marketing and engagement tactic since email. Using our proprietary software and structure, we partner with insurance carriers, brokers, and agents to engage their customers like never before.\u003c/p\u003e\n\u003cp\u003eIt’s not often that you get to say this when talking about insurance, but with Marble, everybody truly does win.\u003c/p\u003e\n\u003cp\u003eMarble is backed by IA Capital, the longest tenured insurtech- and fintech-focused venture capital firm in the US with a 20 year track record of successful investments and exits.\u003c/p\u003e\n\u003cp\u003eWhat you’ll do:\u003c/p\u003e\n\u003cp\u003eMarble is looking for an Engineering Director to spearhead the development and growth of our early prototypes and products. Working with Marble’s CTO , you will lay the foundation for a best-in-class engineering team that collaborates to build delightful products, designs and implements scalable infrastructure, and encourages diversity of experience and thought. Velocity is critical to our success and you will be integral in building the team and the infrastructure that delivers this velocity.\u003c/p\u003e\n\u003cp\u003eWhat you’ll build:\u003c/p\u003e\n\u003cp\u003eAs the Engineering Director, you will work directly with Marble's CTO and CEO to build, lead and scale each of our three digital products: a digital insurance wallet, the first and only rewards platform for insurance, and a B2B co-branded rewards platform for insurance carriers. You will be the lead architect and engineer for Marble's backend microservices built with Django. In addition to building Marble's backend, you will manage our offshore and internal React.js frontend teams.\u003c/p\u003e\n\u003cp\u003eAbout you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are a manager with 7+ years of technology experience, specifically with Python and preferably with Django\u003c/li\u003e\n\u003cli\u003eYou have experience managing and working with JavaScript, specifically React.js, teams and codebases\u003c/li\u003e\n\u003cli\u003eExperience in a fast growing organization building out processes and teams\u003c/li\u003e\n\u003cli\u003eExperience working with complex problems involving multiple partners\u003c/li\u003e\n\u003cli\u003eYou have a track record of building and motivating high performing engineering teams to continuously innovate, collaborate, and improve\u003c/li\u003e\n\u003cli\u003eYou have demonstrated success building highly scalable APIs, back end platforms, distributed systems, data access layers, etc.\u003c/li\u003e\n\u003cli\u003eYou have successfully recruited high performing individual contributors and managers\u003c/li\u003e\n\u003cli\u003eYou’re committed to collaboration and able to work well with other business units to build, test, and measure solutions that increase organizational velocity\u003c/li\u003e\n\u003cli\u003eYou’ve excelled in fast-paced, ambiguous environments, particularly by organizing yourself and others with strong and flexible frameworks and processes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCoordinate with Marble’s CTO to set the technical roadmap for the delivery our earliest product improvements and launches\u003c/li\u003e\n\u003cli\u003ePartner on the technology budget, driving the selection of third-party technologies and assisting with contract negotiations\u003c/li\u003e\n\u003cli\u003ePartner on the talent strategy and roadmap for Marble’s engineering team\u003c/li\u003e\n\u003cli\u003eVet, interview, and hire engineers and engineering managers\u003c/li\u003e\n\u003cli\u003eLead and build the back end engineering team as Marble scales nationally to \u0026gt;1MM members\u003c/li\u003e\n\u003cli\u003eCoordinate with technology leadership at the largest insurance carriers in the US and worldwide, as they integrate Marble’s technology platform\u003c/li\u003e\n\u003cli\u003eMaintain and strengthen best-in-class data security and privacy practices\u003c/li\u003e\n\u003cli\u003eWriting code, and lots of it. Though this is a senior position, we are a small team so we expect our early engineering hires to be in the code every day until you hire a team around you.\u003c/li\u003e\n\u003cli\u003eWe are an early stage company and we ask that all candidates review this job description knowing that the only thing we are certain of is: things will change, including your responsibilities. Please only apply to this role if you are comfortable with this.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApply here: \u003ca href=\"https://jobs.lever.co/marblepay/7d97f9f3-89fd-4c54-ba18-e96f8e733861/apply\"\u003ehttps://jobs.lever.co/marblepay/7d97f9f3-89fd-4c54-ba18-e96f8e733861/apply\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGFPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7f8f2e568ebf8434bc17b124f14852f89862d77e/logotype_dark%20google%20admin.png"},
    
    {"id":"4926de97-addf-4f0e-afde-44b83dad5d73","type":"Full Time","url":"https://jobs.github.com/positions/4926de97-addf-4f0e-afde-44b83dad5d73","created_at":"Sun Nov 08 23:03:35 UTC 2020","company":"ResoluteAI","company_url":"https://www.resolute.ai","location":"New York City","title":"Full Stack Engineer","description":"\u003cp\u003eResoluteAI is a fast-growth data aggregation and intelligent search startup, with a mission to enable scientifically driven organizations to make their next big discovery. Our tools allow our clients to find relevant results in an efficient manner, across patents, clinical trials, publications, drug and medical device datasets, and within their own internal corporate documents (enterprise search). We accomplish this through our proprietary machine learning algorithms. We are proud to count amongst our clients two of the top four (and five of the top twelve) global pharmaceutical firms by market cap.\u003c/p\u003e\n\u003cp\u003eWe are looking for full-stack developers to help build out our capabilities as we continue to grow.\u003c/p\u003e\n\u003cp\u003eDuties and Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIntegrate public domain datasets into the search platform using our ETL framework.\u003c/li\u003e\n\u003cli\u003eDesign and implement new features that integrate and highlight the various public datasets.\u003c/li\u003e\n\u003cli\u003eWork with various external enterprise search APIs to ingest and enrich clients’ documents for search.\u003c/li\u003e\n\u003cli\u003eAssist machine learning engineers with deploying their models into production\u003c/li\u003e\n\u003cli\u003eCommunicate directly with clients on requirements, progress, and setting expectations.\u003c/li\u003e\n\u003cli\u003eAssist with bug fixes and writing of regression and unit tests.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation and Previous Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s degree in Computer Science, or equivalent experience in software development\u003c/li\u003e\n\u003cli\u003e5+ years in related experience and training\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKnowledge and Skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStrongly skilled in Python. Experience with SQL and an ORM (e.g. sqlalchemy).\u003c/li\u003e\n\u003cli\u003eCan hold your own on the frontend UI in ReactJS\u003c/li\u003e\n\u003cli\u003eComfortable working with Docker and in a Linux environment\u003c/li\u003e\n\u003cli\u003eExperience with ElasticSearch – very strong plus\u003c/li\u003e\n\u003cli\u003eExperience with Elastic Map Reduce or Spark is a plus\u003c/li\u003e\n\u003cli\u003eKnowledge of networking, especially AWS services and infrastructure is a plus\u003c/li\u003e\n\u003cli\u003eMust have a self-starter mentality and willingness to dig deep into the code.\u003c/li\u003e\n\u003cli\u003eAbility to own your work and adopt an outcomes-based approach, in a fast paced environment of quickly evolving requirements.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we offer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary\u003c/li\u003e\n\u003cli\u003eFull benefits (Medical, Dental, Vision, FSA, Commuter benefit)\u003c/li\u003e\n\u003cli\u003e401(k) and matching\u003c/li\u003e\n\u003cli\u003eEquity in the company\u003c/li\u003e\n\u003cli\u003eUnlimited Paid Time Off\u003c/li\u003e\n\u003cli\u003eFlexible Work Environment\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease apply at the following website:\n\u003ca href=\"https://resoluteai.applytojob.com/apply/qEBd0FBx4a/Full-Stack-Developer?source=Github\"\u003ehttps://resoluteai.applytojob.com/apply/qEBd0FBx4a/Full-Stack-Developer?source=Github\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVNPIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--31ebcafc76d4d80670dd7fdb6e385ec835429a19/Resolute-logo-dark-250px.png"}
]
